Repository: khsora34/historiasDelLaberinto
Catalog: loadedGame/texts/*.strings
Languages: es

# newGameButton
source: New game
es: Nueva partida

# loadGameButton
source: Load game
es: Cargar partida

# gameTitle
source: Labyrinth adventures
es: Historias del Laberinto

# changeLanguageButtonText
source: Change language
es: Cambiar idioma

# genericButtonSave
source: Save
es: Guardar

# genericButtonAccept
source: Ok
es: Aceptar

# loadingGameError
source: An error was encountered while loading a new game. Please, try again later.
es: Ha habido un error intentando comenzar una nueva partida. Vuelve a intentarlo en otro momento.

# loadingPrompt
source: Loading, please wait...
es: Cargando, espera un momento...

# movementAction
source: Move
es: Moverse

# movementActualRoomStart
source: You are now in room
es: Te encuentras en la sala

# menuExitPrompt
source: Are you sure that you want to exit the game? Please, save beforehand.
es: ¿Estás seguro de que quieres salir? Se borrará tu progreso si sales sin guardar.

# genericRiskOption
source: I'll handle it
es: Me arriesgaré

# genericThinkAboutItOption
source: Let me think again
es: Déjame pensarlo

# secondaryMenuTitle
source: Menu
es: Menú

# successfullySavedGame
source: Game successfully saved
es: Juego guardado con éxito.

# menuOptionItems
source: Items
es: Inventario

# menuOptionSave
source: Save
es: Guardar

# menuOptionExit
source: Exit game
es: Salir

# healthIndicator
source: Health points
es: Puntos de vida

# consumableItemCategory
source: Consumable item
es: Objeto consumible

# weaponItemCategory
source: Weapon
es: Arma

# keyItemCategory
source: Key item
es: Objeto clave

# statusAilmentPoison
source: Poison
es: Veneno

# statusAilmentParalysis
source: Paralysis
es: Parálisis

# statusAilmentBlindness
source: Blindness
es: Ceguera

# choiceEventMessage
source: Choose an option.
es: Escoge una opción.

# itemsViewTitle
source: Items
es: Inventario

# battleOptionAttack
source: Attack
es: Atacar

# battleStartDialogue
source: wants to fight.
es: quiere pelear.

# battleActionAttack
source: attacks!
es: ataca.

# battleActionAttackMissed
source: But misses the attack...
es: Pero falló el ataque...

# battleActionAttackAbsorbed
source: absorbs the hit.
es: absorbe el ataque.

# battleMessageGetPoisoned
source: is now poisoned.
es: ahora está envenenado.

# battleMessageGetParalyzed
source: is now paralyzed.
es: ahora está paralizado.

# battleMessageGetBlind
source: is now blind.
es: ahora está ciego.

# battleMessageStillPoisoned
source: is still poisoned.
es: sigue envenenado.

# battleMessageStillParalyzed
source: is still paralyzed.
es: sigue paralizado.

# battleMessageStillBlind
source: is still blind.
es: sigue ciego.

# battleMessagePoisonEffect
source: is hurt by poison.
es: pierde vida por el veneno.

# battleMessageParalysisEffect
source: is paralyzed and can't move.
es: está paralizado, no puede moverse.

# battleMessageFinishPoison
source: is no longer poisoned
es: ya no está envenenado.

# battleMessageFinishParalysis
source: is no longer paralyzed.
es: ya no está paralizado.

# battleMessageFinishBlindness
source: is no longer blind.
es: ya no está cegado.

# battlePartnerFaints
source: I'm sorry, I can't last any longer...
es: Lo siento, ya no puedo más...

# battlePlayerFaints
source: You start losing your conciousness.
es: Empiezas a perder la consciencia.

# battleExtraPartnerWin
source: Yes, we did it!
es: ¡Sí, lo hemos conseguido!

# battleExtraAloneWin
source: You managed to defeat the villain.
es: Has conseguido derrotar al malo.

# battleOneHit
source: once
es: una vez

# battleMoreHits
source: times
es: veces

# battleHit
source: hits
es: golpea

# battleHitTargetConnector
source: to
es: a

# itemBoneName
source: Bone
es: Hueso

# itemBoneDescription
source: It's just a bone.
es: Es solo un hueso, nada más.

# itemPotionName
source: Potion
es: Poción

# itemPotionDescription
source: Restores 250 health points to the user.
es: Permite recuperar a un personaje 250 puntos de vida.

# itemSmallKeyName
source: Small key
es: Llave pequeña

# itemSmallKeyDescription
source: A small key made for opening treasures.
es: Una llave pequeña que encaja en ciertos cofres.

# room3Name
source: Dragon's room
es: Habitación del dragón

# room18Name
source: The chair room
es: Habitación de la silla

# room3Description
source: This room is the place for a really big and frightening dragon.
es: En esta habitación se encuentra un gran y temible dragón.

# room18Description
source: The room is painted with white color. There's a green chair at the center of the room.
es: La habitación está toda pintada de blanco. En el medio, se encuentra una silla verde.

# indiferentActionName
source: Indifferent
es: Indiferente

# interestedActionName
source: Interested
es: Interesado

# braveActionName
source: Brave
es: Valiente

# cowardActionName
source: Coward
es: Cobarde

# boldActionName
source: Bold
es: Osado

# keepExploringActionName
source: Keep exploring
es: Continuar explorando

# escapeActionName
source: Escape
es: Escapar

# attackActionName
source: Attack
es: Atacar

# talkWithGerarActionName
source: Talk to Gerardo
es: Hablar con Gerardo

# room3TalkActionName
source: Talk to the dragon
es: Hablar con el dragón

# room3StartEventMessage
source: At the end of the cave you see a big hole. It could be the exit!
es: Encuentras a lo lejos de la habitación una abertura. ¡Puede ser la salida!

# room3StartEventMessage_2
source: However, a giant dragon is on the way.
es: Sin embargo, se interpone un gigantesco dragón en el camino.

# room3TalkEventMessage
source: Who is the one bothering my slumber!?
es: ¿¡Quién se atreve a perturbar mi descanso!?

# room3TalkEventIndiferentMessage
source: You decide not to talk to the dragon.
es: Decides no dirigerle la palabra.

# room3TalkEventIndiferent2Message
source: You, human! Do not dare to ignore me.
es: ¡Habla, humano! No oses burlarte de mí.

# room3TalkEventInterestedMessage
source: You ask the dragon for its name.
es: Preguntas al dragón quién es.

# room3TalkEventBoldMessage
source: You demand its name.
es: Exiges su nombre.

# room3TalkEventBold2Message
source: Who do you think are you talking to, MISERABLE HUMAN?
es: ¿Y ese tono? ¿Quién te crees que eres, MÍSERO HUMANO?

# room3TalkEvent_2Message
source: I am Grima and this shall be the last words you will ever hear.
es: Mi nombre es Grima y esto es lo último que oirás, porque voy a acabar contigo.

# room3TalkEventWithGerar_2Message
source: I am Grima and I shall end your life now. Please do not run, because I will get you.
es: Mi nombre es Grima y ahora acabaré con vosotros. No conseguiréis salir de este laberinto con vida.

# room3TalkEventWithGerar_2_2Message
source: Great, you managed to anger the dragon...
es: Muy bien, has conseguido cabrear al dragón...

# room3TalkEventChoice2IndiferentMessage
source: You keep looking the dragon with your mind empty.
es: Sigues mirando al dragón, sin pensar en nada.

# room3TalkEventChoice2BraveMessage
source: You decide to stand against the dragon.
es: Miras fíjamente al dragón y decides plantarle cara.

# room3TalkEventChoice2CowardMessage
source: You try to apologize to the dragon.
es: Intentas disculparte con el gran dragón negro.

# room3TalkEventChoice2Coward_2Message
source: It is too late, my dear, for you shall perish today.
es: Ya es tarde, criatura, no conseguirás salvarte.

# room3TalkEvent_3Message
source: Now rejoice in my power!
es: Ahora regocíjate de mi poder.

# room3TalkEvent_4WithGerarMessage
source: Let's go, Cisco! This will probably be our last battle, let's fight for our freedom!
es: ¡Vamos Cisco! Esta será la última batalla, por nuestra libertad.

# defaultBadEndingMessage
source: You won't be able to endure much more on the fight.
es: No vas a poder aguantar mucho más el tipo.

# defaultBadEnding2Message
source: You close for eyes, as your conciousness slides away.
es: Cierras los ojos para no volver a abrirlos.

# room3BattleVictory
source: The giant dragon falls on the nearest wall. It seems it's sleeping. This is your chance to escape!
es: El enorme dragón cae bajo su propio peso en una de las paredes laterales. ¡Esta es tu oportunidad de escapar!.

# room3BattleVictory2Message
source: Do you want to escape, or do you prefer to keep exploring?
es: ¿Quieres escapar, o prefieres seguir explorando?

# room3EscapeEventWithGerarMessage
source: Let's go, Cisco, together!
es: Vamos Cisco, ¡juntos!

# room3EscapeEventWithGerar2Message
source: You nod your head with a big smile. You take Gerardo's hand and run to the cave's entrance.
es: Afirmas con la cabeza y una sonrisa. Corréis hacia el agujero, en pos de un nuevo mañana.

# room3EscapeEventMessage
source: You decide to leave the labyrinth forever.
es: Decides escapar del laberinto de una vez por todas.

# room3BattleVictoryWithGerarMessage
source: Yes, we did it!
es: ¡Sí, lo conseguimos!

# room3BattleVictoryWithGerar2Message
source: NO! You mere mortals will not get away with this victory.
es: ¡No! Vosotros, ESTÚPIDOS MORTALES, no os saldréis con la vuestra.

# room3BattleVictoryWithGerar3Message
source: With its last effort, the dragon tries to land on Gerardo.
es: Con su último esfuerzo, el dragón coge impulso e intenta aplastar a Gerardo.

# room3BattleVictoryWithGerar4Message
source: You try to warn him, but...
es: Intentas gritar fuerte para avisarle.

# room3BattleVictoryWithGerar5Message
source: Gerardo quickly evades the dragon's last attack and gets away from it. The dragon, really angered, shouts really high as its eyes close up.
es: Gerardo se echa a un lado justo a tiempo. El dragón, frustrado, exhala un último hálito de fuego antes de cerrar los ojos.

# room3BattleVictoryWithGerar6Message
source: Phew, that was really a close one.
es: Puff, esa sí que ha estado cerca.

# room3BattleVictoryWithGerar7Message
source: You turn to the cave's entrance. From there, you can enjoy the view of the ocean. It seems like there's nothing else on your escape route. What do you want to do?
es: Te giras hacia la gran abertura que da al mar. Ya nada se interpone en vuestra huida. ¿Qué quieres hacer?

# room3DiscussIsDragonMessage
source: Are you sure this is the exit? That dragon is freaking huge...
es: ¿Estás seguro de que deberíamos salir por ahí? Ese es un peazo dragón...

# room3DiscussNoDragonMessage
source: Well, at least the dragon looks dead. When are we escaping?
es: Bueno, por lo menos el dragón ya no está. ¿Cuándo nos vamos?

# room3AttackEventMessage
source: You decide to face the dragon.
es: Decides enfrentarte al dragón sin miramientos.

# room3AttackEventWithGerarMessage
source: Yup, you did go crazy.
es: Sí, definitivamente se te ha ido la flapa.

# room3AttackEvent2Message
source: I see you enjoy going straight to the point. You see, I enoy it too.
es: Veo que te gusta ir al grano. Comencemos entonces.

# room18StartEventMessage
source: You enter on a room colored white. At the center of the room, there's a green chair.
es: Entras en una habitación completamente pintada de blanco. En el medio de la habitación, observas una silla de color verde.

# room18TalkWithGerarEventMessage
source: I think this is the room I woke up from!
es: ¡Esta es la habitación en la que desperté yo!

# room18SitActionName
source: Sit on the chair
es: Sentarse

# room18SitEventMessage
source: You sit on the green chair.
es: Te sientas en la silla verde.

# room18SitEvent2Message
source: You are surprised at how confortable it is.
es: Te sorprendes de lo cómoda que es.
